Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.WallAMLostAdjustmentReference
Wall Analytical Model has lost its adjustment reference.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.SupportCheckDone
Member support check is complete.  No unsupported elements detected.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.StructuralElementMayNotBeSupported
Structural Element may not be supported -- verify support for Element.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.StructWallAnalyticalErrorConversion
Can't convert Edges to Analytical Model curves.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.StructWallAnalyticalErrorAlign
Can't align Analytical Model with joined Walls.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.StructAnalyticalErrorProjection
Can't project Analytical Model to Analytical Projection Surface

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.ProjectionPlanesParallel
Can't project Analytical Model. Two or more projection planes are parallel.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.ProjectionPlanesNotIntersect
Can't project Analytical Model. Planes do not intersect each other.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.ProjectionPlaneInvalidWall
Projection plane becomes invalid for this wall.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.LoadsMayBeNotUpToDate
Reactions defined as Internal Load (Is Reaction) may no longer be valid since the analytical model has changed.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.CannotMakeAnalyticalGeometry
Cannot construct Analytical Geometry.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.CannotKeepAnalyticalAdjustment
Analytical model Adjustment distance exceeds current Adjustment Snapping Distance.  To adjust snap settings, go to the Structural Settings Dialog.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.CannotCreateAnalyticalGeometry
Cannot construct Analytical Geometry.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.BoundaryLinesIntersect
Boundary lines intersect.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AutoDetectIgnoreLeaderWarning
Analytical Model for Structural Element has reset to its default location.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalTopBottomPlanesReversed
Analytical Top Projection Plane is partially or completely below Analytical Bottom Projection Plane.  Please reset
top and/or bottom planes to valid values.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalSupportCycleWarning
Circular support chain detected

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalPhysicalCheckDone
Analytical / Physical Model Consistency check is complete.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalModelIsIncorrect
Analytical Model is not created for the structural element.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalModelInstability
Possible Model Instability

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalMemberInstability
Possible Member Instability,  based on Release Conditions

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalLinkNotConnected
Analytical Link has lost one or more references.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalLinkJoinedNodes
Analitycal Link is invalid. Reference nodes have been joined.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalGapWarning
Detected physical connection between Structural Elements,  but did not detect Analytical intersection.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalDiscrepancyWarning
Distance between Analytical and Physical Models of Structural Element is beyond tolerance of [Value]

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalBeamSlabWarning
Beam and Slab Analytical Models do not have the same Analytical Projection Plane.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShortWarn
AdjustEdge is too short.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShortErr
AdjustEdge is too short - continuable error version.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShort
AdjustEdge is too short.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AdjustCurveTooShort
AdjustCurve is too short.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures
Failures about AnalyticalModel.